backup3/backup3-baseline.log
seq-read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
rand-read: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
seq-write: (g=2): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
rand-write: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.25
Starting 4 processes

seq-read: (groupid=0, jobs=1): err= 0: pid=2922: Mon Aug 22 12:53:21 2022
  read: IOPS=658k, BW=2569MiB/s (2694MB/s)(10.0GiB/3986msec)
    slat (nsec): min=900, max=33382, avg=938.80, stdev=172.69
    clat (nsec): min=1010, max=38847, avg=4973.00, stdev=572.35
     lat (nsec): min=2051, max=66054, avg=5942.94, stdev=666.70
    clat percentiles (nsec):
     |  1.00th=[ 4896],  5.00th=[ 4896], 10.00th=[ 4896], 20.00th=[ 4896],
     | 30.00th=[ 4896], 40.00th=[ 4896], 50.00th=[ 4896], 60.00th=[ 4896],
     | 70.00th=[ 4896], 80.00th=[ 4960], 90.00th=[ 5088], 95.00th=[ 5152],
     | 99.00th=[ 5152], 99.50th=[ 5856], 99.90th=[18048], 99.95th=[18048],
     | 99.99th=[20864]
   bw (  MiB/s): min= 2516, max= 2597, per=100.00%, avg=2571.30, stdev=28.59, samples=7
   iops        : min=644231, max=664878, avg=658252.29, stdev=7317.22, samples=7
  lat (usec)   : 2=0.01%, 4=0.01%, 10=99.76%, 20=0.21%, 50=0.03%
  cpu          : usr=43.01%, sys=56.94%, ctx=5, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2621440,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-read: (groupid=1, jobs=1): err= 0: pid=2923: Mon Aug 22 12:53:21 2022
  read: IOPS=624k, BW=2439MiB/s (2557MB/s)(10.0GiB/4199msec)
    slat (nsec): min=914, max=28307, avg=963.64, stdev=165.67
    clat (nsec): min=1045, max=45041, avg=5222.29, stdev=579.99
     lat (nsec): min=2015, max=62623, avg=6217.23, stdev=671.17
    clat percentiles (nsec):
     |  1.00th=[ 5088],  5.00th=[ 5088], 10.00th=[ 5088], 20.00th=[ 5152],
     | 30.00th=[ 5152], 40.00th=[ 5152], 50.00th=[ 5152], 60.00th=[ 5152],
     | 70.00th=[ 5152], 80.00th=[ 5280], 90.00th=[ 5408], 95.00th=[ 5408],
     | 99.00th=[ 5472], 99.50th=[ 6048], 99.90th=[18560], 99.95th=[18816],
     | 99.99th=[21120]
   bw (  MiB/s): min= 2394, max= 2468, per=100.00%, avg=2442.19, stdev=24.23, samples=8
   iops        : min=612902, max=631838, avg=625201.25, stdev=6202.69, samples=8
  lat (usec)   : 2=0.01%, 4=0.01%, 10=99.76%, 20=0.21%, 50=0.03%
  cpu          : usr=46.93%, sys=53.03%, ctx=5, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2621440,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
seq-write: (groupid=2, jobs=1): err= 0: pid=2924: Mon Aug 22 12:53:21 2022
  write: IOPS=95.5k, BW=373MiB/s (391MB/s)(10.0GiB/27453msec); 0 zone resets
    slat (usec): min=3, max=1063, avg= 7.46, stdev= 4.50
    clat (usec): min=14, max=1422, avg=33.84, stdev=35.46
     lat (usec): min=22, max=1427, avg=41.47, stdev=36.06
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   23], 10.00th=[   26], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   28], 50.00th=[   29], 60.00th=[   29],
     | 70.00th=[   31], 80.00th=[   36], 90.00th=[   51], 95.00th=[   61],
     | 99.00th=[   81], 99.50th=[  112], 99.90th=[  660], 99.95th=[ 1057],
     | 99.99th=[ 1106]
   bw (  KiB/s): min=290712, max=431968, per=100.00%, avg=381955.15, stdev=29839.25, samples=54
   iops        : min=72678, max=107992, avg=95488.72, stdev=7459.90, samples=54
  lat (usec)   : 20=1.43%, 50=88.26%, 100=9.55%, 250=0.55%, 500=0.10%
  lat (usec)   : 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.08%
  cpu          : usr=10.95%, sys=55.35%, ctx=2116524, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2621440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-write: (groupid=3, jobs=1): err= 0: pid=2945: Mon Aug 22 12:53:21 2022
  write: IOPS=127k, BW=497MiB/s (521MB/s)(10.0GiB/20590msec); 0 zone resets
    slat (usec): min=2, max=125, avg= 5.01, stdev= 2.83
    clat (nsec): min=474, max=1171.7k, avg=25799.55, stdev=30310.92
     lat (usec): min=16, max=1174, avg=30.92, stdev=30.48
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[   17], 10.00th=[   18], 20.00th=[   20],
     | 30.00th=[   21], 40.00th=[   21], 50.00th=[   22], 60.00th=[   23],
     | 70.00th=[   24], 80.00th=[   25], 90.00th=[   41], 95.00th=[   56],
     | 99.00th=[   66], 99.50th=[   73], 99.90th=[  347], 99.95th=[ 1029],
     | 99.99th=[ 1074]
   bw (  KiB/s): min=373872, max=582616, per=100.00%, avg=509956.88, stdev=51365.15, samples=41
   iops        : min=93468, max=145654, avg=127489.22, stdev=12841.42, samples=41
  lat (nsec)   : 500=0.01%, 750=0.01%
  lat (usec)   : 2=0.01%, 10=0.01%, 20=23.15%, 50=70.73%, 100=5.92%
  lat (usec)   : 250=0.06%, 500=0.07%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.06%
  cpu          : usr=14.73%, sys=54.06%, ctx=2147772, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2621440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=2569MiB/s (2694MB/s), 2569MiB/s-2569MiB/s (2694MB/s-2694MB/s), io=10.0GiB (10.7GB), run=3986-3986msec

Run status group 1 (all jobs):
   READ: bw=2439MiB/s (2557MB/s), 2439MiB/s-2439MiB/s (2557MB/s-2557MB/s), io=10.0GiB (10.7GB), run=4199-4199msec

Run status group 2 (all jobs):
  WRITE: bw=373MiB/s (391MB/s), 373MiB/s-373MiB/s (391MB/s-391MB/s), io=10.0GiB (10.7GB), run=27453-27453msec

Run status group 3 (all jobs):
  WRITE: bw=497MiB/s (521MB/s), 497MiB/s-497MiB/s (521MB/s-521MB/s), io=10.0GiB (10.7GB), run=20590-20590msec

Disk stats (read/write):
    md2: ios=0/5226531, merge=0/0, ticks=0/89184, in_queue=89184, util=85.45%, aggrios=38483/5289530, aggrmerge=51304/52686, aggrticks=4235/89225, aggrin_queue=93461, aggrutil=87.70%
  nvme0n1: ios=76967/5251044, merge=102608/1374, ticks=8470/80915, in_queue=89386, util=87.66%
  nvme1n1: ios=0/5328017, merge=0/103998, ticks=0/97536, in_queue=97536, util=87.70%